<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of XMind8.</string>
	<key>Identifier</key>
	<string>com.github.peshay.download.XMind8</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>XMind 8</string>
		<key>BASEURL</key>
		<string>//www.xmind.net/xmind/downloads/</string>
<!-- REPLACE OS IN YOUR RECIPE WITH
	 For WINDOWS use windows
     For MAC OX use macosx
     For LINUX use linux -->
		<key>OS</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.xmind.net/download/xmind8</string>
                <key>re_pattern</key>
                <string>%BASEURL%xmind-[0-9]*-([^"]*)-%OS%.</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
		<key>result_output_var_name</key>
		<string>version</string>
            </dict>
        </dict>
 <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.xmind.net/download/xmind8</string>
                <key>re_pattern</key>
		<string>(%BASEURL%xmind-[0-9]*-%version%-%OS%.[a-zA-Z]*)</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                		<key>url</key>
                		<string>https:%url%</string>
			</dict>
		</dict>

		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
