<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of InsomniaX and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.InsomniaX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>InsomniaX</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.InsomniaX</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.keeleysam.recipes.InsomniaX.download</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.keeleysam.recipes.InsomniaX.download</key>
			<dict>
				<key>git_hash</key>
				<string>bd68c2f451bb7d088705102a1a0fddc543c48f37</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.keeleysam-recipes/InsomniaX/InsomniaX.download.recipe</string>
				<key>sha256_hash</key>
				<string>e85ba676e1497b926fb2a65bf712cf29158fa99b2f5b395a9db051430a964164</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/InsomniaX.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
