<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of OpenShot.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.OpenShot</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenShot</string>
	
<!--SELECT YOUR OS VERSION AND USE IT IN YOUR OVERRIDE
	"dmg" for MAC OS X
	"exe" for WINDOWS
	"AppImage" for LINUX
-->
		<key>os</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
        	<key>Arguments</key>
        	<dict>
          		<key>github_repo</key>
          		<string>OpenShot/openshot-qt</string>
          		<key>asset_regex</key>
          		<string>(OpenShot-v[0-9]+.[0-9]+.[0-9]+-x86_64.%os%)</string>
        	</dict>
        		<key>Processor</key>
        		<string>GitHubReleasesInfoProvider</string>
      	</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>filename</key>
                <string>%NAME%-%version%.%os%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
