<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads KeyStore Explorer</string>
	<key>Identifier</key>
	<string>com.github.peshay.download.keystore-explorer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
        <string>KeyStore Explorer</string>
	<!--SELECT YOUR OS VERSION AND USE IT IN YOUR OVERRIDE
	"dmg" for MAC OS X
	"exe" for WINDOWS
	"zip" for LINUX
	-->
		<key>os</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.0</string>
	<key>Process</key>
	<array>
        <dict>
        	<key>Arguments</key>
        	<dict>
          		<key>github_repo</key>
          		<string>kaikramer/keystore-explorer</string>
          		<key>asset_regex</key>
          		<string>(kse-[0-9]+[^"]*.%os%)</string>
        	</dict>
        		<key>Processor</key>
        		<string>GitHubReleasesInfoProvider</string>
      	</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.%os%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/*.app</string>
                <key>requirement</key>
                <string>identifier "org.kse.kse540" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = BKXPBP395L</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
