<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of draw.io Desktop.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.draw.io</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>draw.io Desktop</string>
		<!-- VALID os FOR THIS RECIPE ARE: dmg (OS X), exe (Windows), deb (Linux Debian/Ubuntu), AppImage (Linux AppImage) -->
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.draw.io/</string>
                <key>re_pattern</key>
				<string>href="(https://github.com/jgraph/drawio-desktop/releases/download/v(?P&lt;version&gt;[0-9]+.[0-9]+.[0-9]+)/draw.io[^"]*.%os%)" class="btn"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>%url%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
