<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of MTR and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.MTR</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MTR</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.MTR</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.pkg</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.MTR</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.peshay.download.MTR</key>
			<dict>
				<key>git_hash</key>
				<string>675b5dfa397f5402d9d400ed8bfc6ee7f1f421f1</string>
				<key>path</key>
				<string>/Users/ahu/git/peshay/peshay-recipes/MTR/MTR.download.recipe</string>
				<key>sha256_hash</key>
				<string>a79c5124260f61c3824dd1b57603a0ed8ec32fe6b281758d4b86214be84dcdb6</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
