<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Evernote and imports into FileWave.
</string>
	<key>Identifier</key>
	<string>com.github.autopkg.filewave.Evernote</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Evernote</string>
		<key>fw_app_bundle_id</key>
		<string>com.evernote.Evernote</string>
		<key>fw_destination_root</key>
		<string>/Applications/Evernote.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.autopkg.download.Evernote</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				<key>purge_destination</key>
				<true/>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>Comment</key>
				<string>Specify the bundle ID and version in order to get FileWave to check for duplicate imports. This only works for filesets imported by AutoPkg, not for filesets you added to FileWave by hand.</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Evernote.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
