<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Thonny and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.Thonny</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Thonny</string>
		<!-- REPLACE OS IN YOUR RECIPE WITH
		For WINDOWS use Windows
		For MAC OSX use Mac -->
		<key>OS</key>
		<string>Mac</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.Thonny</string>
		<key>fw_destination_root</key>
		<string>/Applications/Thonny.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.Thonny</string>
	<key>Process</key>
	<array>
	<dict>
    	<key>Processor</key>
    	<string>CodeSignatureVerifier</string>
    	<key>Arguments</key>
    		<dict>
        		<key>input_path</key>
        		<string>%pathname%/*.app</string>
        		<key>requirement</key>
        		<string>identifier "org.thonny" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2SA9D4CVU8"</string>
    		</dict>
	</dict>
	<dict>
		<key>Arguments</key>
		<dict>
			<key>destination_path</key>
			<string>%RECIPE_CACHE_DIR%/Thonny.app</string>
			<key>source_path</key>
			<string>%pathname%/*.app</string>
		</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/Thonny.app/Contents/Info.plist</string>
            </dict>
            <key>Processor</key>
            <string>Versioner</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/Thonny.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
