<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of Thonny.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.Thonny</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Thonny</string>
        <!-- REPLACE OS IN YOUR RECIPE WITH
        For WINDOWS use Windows
        For MAC OSX use Mac -->
        <key>OS</key>
        <string></string>
       </dict>
       <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://thonny.org</string>
                <key>re_pattern</key>
                <string>href="([^"]*thonny-[^"]*.[dmg|exe])">%OS%</string>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
