<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Platypus.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.Platypus</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Platypus</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>sveinbjornt/Platypus</string>
                <key>include_prereleases</key>
                <string>%PRERELEASE%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Platypus.app</string>
                <key>requirement</key>
                <string>identifier "org.sveinbjorn.Platypus" and anchor apple generic and certificate leaf[subject.CN] = "Mac Developer: sveinbjornt@gmail.com (55GP2M789L)" and certificate 1[field.1.2.840.113635.100.6.2.1] /* exists */</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
