<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ParallelsDesktopDeploy pkg including license key and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.ParallelsDesktopDeploy</string>
	<key>Input</key>
	<dict>
		<key>LICENSE_KEY</key>
		<string>XXXXXX-XXXXXX-XXXXXX-XXXXXX-XXXXXX</string>
		<key>MAJOR_VERSION</key>
		<string>11</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.ParallelsDesktopDeploy%MAJOR_VERSION%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.pkg.ParallelsDesktopDeploy</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.ParallelsDesktop</key>
			<dict>
				<key>git_hash</key>
				<string>d880f7890123933cdb010acad47d21b57e1a0b9c</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Parallels/ParallelsDesktop.download.recipe</string>
				<key>sha256_hash</key>
				<string>f21c093efa95b2f0ac4e6dbec232ce6efd99fe473cc1a52efc1068b7feec7975</string>
			</dict>
			<key>com.github.peshay.pkg.ParallelsDesktopDeploy</key>
			<dict>
				<key>path</key>
				<string>/Users/ahu/git/peshay/peshay-recipes/Parallels/ParallelsDesktopDeploy.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>688b281354ea4a9563a63a02de75bc3f43af42774e2b12eeff122cf52b4c1b5f</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version% - %LICENSE_KEY%</string>
				<key>fw_import_source</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
