<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest ParallelsDesktopDeploy pkg including license key and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.ParallelsDesktopDeploy</string>
	<key>Input</key>
	<dict>
        <key>MAJOR_VERSION</key>
		<string>11</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.peshay.filewave.ParallelsDesktopDeploy%MAJOR_VERSION%</string>
        <key>LICENSE_KEY</key>
        <string>XXXXXX-XXXXXX-XXXXXX-XXXXXX-XXXXXX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.pkg.ParallelsDesktopDeploy</string>
	<key>Process</key>
    <array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version% - %LICENSE_KEY%</string>
				<key>fw_import_source</key>
				<string>%found_filename%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
    </array>
</dict>
</plist>
