<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Brackets and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.Brackets</string>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.jps3.download.Brackets</string>
    <key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Brackets</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.peshay.filewave.Brackets</string>
        <key>fw_destination_root</key>
        <string>/Applications/%NAME%.app</string>
	</dict>
	<key>Process</key>
	<array>
	<dict>
            	<key>Arguments</key>
            	<dict>
                	<key>pkgroot</key>
                	<string>%RECIPE_CACHE_DIR%/Applications</string>
                	<key>pkgdirs</key>
                	<dict>
                    		<key>Applications</key>
                    		<string>0775</string>
                	</dict>
            	</dict>
            		<key>Processor</key>
            		<string>PkgRootCreator</string>
        	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.app</string>
				<key>source_path</key>
				<string>%pathname%/*.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.app/Contents/Info.plist</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
                <string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
