<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Eclipse IDE for Java Developers, creates a fileset, and copies it into your FileWave Server.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.Eclipse</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Eclipse</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.Eclipse</string>
		<key>fw_destination_root</key>
		<string>/Applications/Eclipse.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.EclipseIDEJavaDev</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>Eclipse %version2% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/Eclipse.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
