<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of 5KPlayer.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.5KPlayer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>5KPlayer</string>
        
<!--SELECT YOUR OS VERSION AND INPUT BELOW
	"dmg" for MAC OS X
	"exe" for WINDOWS
-->
        <key>os</key>
        <string>dmg</string><!-- <<<<<< INPUT HERE <<<<<< -->
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.5kplayer.com/download/5kplayer.%os%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
