<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of MerlinProject and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.MerlinProject</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Merlin Project</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.MerlinProject</string>
		<key>fw_app_version</key>
		<string>%version%</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.MerlinProject</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.MerlinProject</key>
			<dict>
				<key>git_hash</key>
				<string>abb8a7a1dd6f0dfa3e23de17829e083126474304</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/MerlinProject/MerlinProject.download.recipe</string>
				<key>sha256_hash</key>
				<string>164a231bc2ac0a937ec1a985d70caf98e15afa670545f58a0ce3e4232b181301</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
