<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads JCE.</string>
	<key>Identifier</key>
	<string>com.github.peshay.download.JCE</string>
	<key>Input</key>
	<dict>
		<key>url</key>
		<string>http://www.oracle.com/technetwork/java/javase/downloads/index.html</string>
        <key>ORACLE_LICENSE_COOKIE</key>
        <string>oraclelicense=accept-securebackup-cookie</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
        <dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>re_pattern</key>
                <string>technetwork/java/javase/downloads/jce[0-9]-download-[0-9]*.html</string>
            </dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://www.oracle.com/%url%</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>re_pattern</key>
                <string>Java Cryptography Extension \(JCE\) Unlimited Strength Jurisdiction Policy Files ([0-9])</string>
            </dict>
		</dict>
        <dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>re_pattern</key>
                <string>http://download.oracle.com/otn-pub/java/jce/[0-9]/jce_policy-[0-9].zip</string>
            </dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>request_headers</key>
                <dict>
                        <key>Cookie</key>
                        <string>%ORACLE_LICENSE_COOKIE%</string>
                </dict>
                <key>url</key>
				<string>%url%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
