<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of UNetbootin.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.UNetbootin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>UNetbootin</string>
		<key>OS</key>
		<string>mac</string><!--  SELECT THE OS HERE (windows) or (mac) -->
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://unetbootin.github.io/</string>
                <key>re_pattern</key>
                <string>href="([^"]*)"&gt;[^"]*src="[^"]*" alt="%OS%"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>%url%</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://launchpad.net/unetbootin/</string>
                <key>re_pattern</key>
                <string>Latest version is ([0-9]+)</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>