<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Cloudya, creates a fileset, and copies it into your FileWave Server.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.cloudya</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Cloudya</string>
    		<key>OS</key>
		<string></string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.cloudya</string>
		<key>fw_destination_root</key>
		<string>/Applications/Cloudya.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.cloudya</string>
	<key>Process</key>
	<array>
		<dict>
            		<key>Processor</key>
            		<string>CodeSignatureVerifier</string>
            		<key>Arguments</key>
            		<dict>
                		<key>input_path</key>
                		<string>%RECIPE_CACHE_DIR%/%NAME%/Cloudya-%version%.dmg/*.app</string>
                		<key>requirement</key>
                		<string>identifier "X26F74J8TH.net.nfon.app.cloudya" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = X26F74J8TH</string>
            		</dict>
        	</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Applications</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Cloudya.app</string>
				<key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Cloudya-%version%.dmg/*.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Cloudya.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
