<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of OpenOffice and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.OpenOffice</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OpenOffice</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.OpenOffice</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.OpenOffice</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>OpenOfficeURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>49471a06962adde75e64ec73f0a2d6ceaeaccf4f</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/OpenOffice/OpenOfficeURLProvider.py</string>
				<key>sha256_hash</key>
				<string>bb4ff833bf4019f0515253f9d404646cb43da95c3338cfbac30deed484aa1591</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>io.github.hjuutilainen.download.OpenOffice</key>
			<dict>
				<key>git_hash</key>
				<string>49471a06962adde75e64ec73f0a2d6ceaeaccf4f</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.hjuutilainen-recipes/OpenOffice/OpenOffice.download.recipe</string>
				<key>sha256_hash</key>
				<string>a6765942108e359e26f710db59db240274ffdab73a8ddc7c05074d9b33cc2547</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/Applications</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/%NAME%.app</string>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%pkgroot%/%NAME%.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
