<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of TorBrowser and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.TorBrowserBundle</string>
	<key>Input</key>
	<dict>
		<key>LANGUAGE</key>
		<string>en-US</string>
		<key>NAME</key>
		<string>TorBrowser</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.TorBrowserBundle</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.homebysix.download.TorBrowserBundle</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.homebysix.download.TorBrowserBundle</key>
			<dict>
				<key>git_hash</key>
				<string>9a05bb6963e6739056a10a3d72453c4df2cb92e6</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.homebysix-recipes/Tor/TorBrowserBundle.download.recipe</string>
				<key>sha256_hash</key>
				<string>37f4091badd2251ae7bf1a1744b4ff0ac93846d623a1c47e02d5b12191099a9a</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% %LANGUAGE% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
