<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of ScreenFlow and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.ScreenFlow</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>ScreenFlow</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.ScreenFlow</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.ScreenFlow</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.peshay.download.ScreenFlow</key>
			<dict>
				<key>git_hash</key>
				<string>3204076c016708f637477f80042e33f1d08002f0</string>
				<key>path</key>
				<string>/Users/ahu/git/peshay/peshay-recipes/ScreenFlow/ScreenFlow.download.recipe</string>
				<key>sha256_hash</key>
				<string>7e24d6c03a5574dbcaeb3b93a447231efa04429d470d7e7a4fa84e35a44a4b16</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
