<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Bluefish.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.Bluefish</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Bluefish</string>
<!--SELECT YOUR OS VERSION AND INPUT INTO THE PARENT RECIPE
	"macosx" for MAC OS X
	"win32" for WINDOWS 32 BIT EXE
-->
		<key>os</key>
		<string>macosx</string>
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.bennewitz.com/bluefish/stable/binaries/%os%/?C=M;O=D</string>
                <key>re_pattern</key>
                <string>href="(?P&lt;match&gt;Bluefish-[^"]*[.exe|.dmg])"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>https://www.bennewitz.com/bluefish/stable/binaries/%os%/%match%</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
