<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of PyCharmPro, creates a fileset, and copies it into your FileWave Server.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.PyCharmPro</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PyCharmPro</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.PyCharmPro</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.mosen.download.PyCharmPro</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>JetbrainsURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>179e97c49478895a3a4e1d1a9fceba65cb21fe19</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.mosen-recipes/JetBrains/JetbrainsURLProvider.py</string>
				<key>sha256_hash</key>
				<string>8c41e8d687a594f782541555fd0a0ac19e55e7557d6c4cc28cb856b883ed0482</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.mosen.download.PyCharmPro</key>
			<dict>
				<key>git_hash</key>
				<string>9127e11ec944e77f5f9874f7e738b22f943ee69c</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.mosen-recipes/JetBrains/PyCharmPro.download.recipe</string>
				<key>sha256_hash</key>
				<string>7f863aa9f14693f407d170307365c1905919d98fb8e7f12b5eeb25da883072f8</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%app_name%</string>
				<key>source_path</key>
				<string>%pathname%/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.johncclayton.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
