<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of DB Browser for SQLite (formerly sqlitebrowser),
			and imports it to Filewave.
			</string>
		<key>Identifier</key>
		<string>com.github.peshay.filewave.DB Browser for SQLite</string>
		<key>MinimumVersion</key>
		<string>0.6.1</string>
		<key>ParentRecipe</key>
		<string>com.github.dataJAR-recipes.download.DB Browser for SQLite</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>DBBrowserforSQLite</string>
			<key>fw_app_bundle_id</key>
			<string>com.github.peshay.filewave.DB Browser for SQLite</string>
			<key>fw_destination_root</key>
        <string>/Applications/DBBrowserforSQLite.app</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>pkgdirs</key>
					<dict>
						<key>Applications</key>
						<string>0775</string>
					</dict>
					<key>pkgroot</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%</string>
				</dict>
				<key>Processor</key>
				<string>PkgRootCreator</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>destination_path</key>
					<string>%pkgroot%/Applications/DBBrowserforSQLite.app</string>
					<key>source_path</key>
					<string>%RECIPE_CACHE_DIR%/downloads/%filename%/DB Browser for SQLite.app</string>
				</dict>
				<key>Processor</key>
				<string>Copier</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>fw_app_bundle_id</key>
					<string>%fw_app_bundle_id%</string>
					<key>fw_app_version</key>
					<string>%version%</string>
					<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
					<key>fw_fileset_name</key>
					<string>%NAME% - %version%</string>
					<key>fw_import_source</key>
					<string>%RECIPE_CACHE_DIR%/Applications/DBBrowserforSQLite.app</string>
				</dict>
				<key>Processor</key>
				<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
			</dict>
		</array>
	</dict>
</plist>
