<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Magewell USB Capture Utility drivers and software.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.Magewell</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Magewell USB Capture Utility</string>
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.magewell.com/downloads/usb-capture#/tools/mac</string>
                <key>re_pattern</key>
                <string>V([0-9]).[^"]*div</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
				<key>result_output_var_name</key>
				<string>major</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.magewell.com/downloads/usb-capture#/tools/mac</string>
                <key>re_pattern</key>
                <string>V[0-9].[0-9].[0-9].([0-9]+)[^"]*div</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
				<key>result_output_var_name</key>
				<string>build</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.magewell.com/downloads/usb-capture#/tools/mac</string>
                <key>re_pattern</key>
                <string>V([0-9].[0-9].[0-9].[0-9]+)[^"]*div</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
				<key>result_output_var_name</key>
				<string>version</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>https://www.magewell.com/files/tools/USBCaptureUtility%major%_macOS_%build%.zip</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
			<key>Arguments</key>
			<dict>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/USB_Capture</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
