<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of FortiClient.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.FortiClient</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FortiClient</string>

<!--SELECT YOUR OS VERSION AND INPUT BELOW
	"dmg" for MAC OS X
	"exe" for WINDOWS EXE
-->

        <key>os</key>
        <string>dmg</string><!-- <<<<<< INPUT HERE <<<<<< -->
        <key>DOWNLOAD_URL</key>
        <string>https://fortinetweb.s3.amazonaws.com/forticlient/downloads/FortiClientOnlineInstaller.%os%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
		<string>https://docs.fortinet.com/product/forticlient</string>
                <key>re_pattern</key>
		<string>\/product\/forticlient\/([0-9]+.[0-9]+)</string>
                <key>result_output_var_name</key>
                <string>v1</string>
            </dict>
        </dict>
        <dict>
        	<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
		<string>https://docs.fortinet.com/product/forticlient/%v1%</string>
                <key>re_pattern</key>
		<string>/document/forticlient/([0-9]+.[0-9]+.[0-9]+)/administration-guide</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
