<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports the VMwareFusion mass deployment package into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.VMwareFusionDeploy</string>
	<key>Input</key>
	<dict>
		<key>LICENSE_KEY</key>
		<string># key = %SERIAL%</string>
		<key>NAME</key>
		<string>VMwareFusionDeploy</string>
		<key>SERIAL</key>
		<string>XXXXX-XXXXX-XXXXX-XXXXX-XXXXX</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.VMwareFusionDeploy</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.patgmac.pkg.VMwareFusionDeploy</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>VMwareFusionURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>682aa5137ad752e17783bf4a3a43dc3afe4b344e</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.justinrummel-recipes/VMware Fusion/VMwareFusionURLProvider.py</string>
				<key>sha256_hash</key>
				<string>ba9ca63ac19aef71e0081d7abb7776a2e2cdd93e7071e895f384089cac41f547</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.patgmac.pkg.VMwareFusionDeploy</key>
			<dict>
				<key>git_hash</key>
				<string>8e50e891e8a550ddc8bf5b75da45fbea296f90eb</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.patgmac-recipes/VMware Fusion/VMwareFusionDeploy.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>2907780787660ed1edaa6c9cf5e8c1039d26eb19b658d44894ae1dcb942fe601</string>
			</dict>
			<key>com.justinrummel.download.VMwareFusion</key>
			<dict>
				<key>git_hash</key>
				<string>3b408aa5b9bdb04fe6f1ab78254bd7ff44743f61</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.justinrummel-recipes/VMware Fusion/VMwareFusion.download.recipe</string>
				<key>sha256_hash</key>
				<string>0fbc6c7dd668a296a7709e38a47b54e81360ec260ae27893bc4e1a75d917109f</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version% - %SERIAL%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.mpkg</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
