<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of VMwareFusion.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.VMwareFusion</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VMwareFusion</string>
		<key>language</key>
		<string>de</string>
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>https://www.vmware.com/go/try-fusion-%language%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
