<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of VMwareFusion and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.VMwareFusion</string>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.justinrummel.download.VMwareFusion</string>
    	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VMwareFusion</string>
        	<key>fw_app_bundle_id</key>
        	<string>com.github.peshay.filewave.VMwareFusion</string>
        	<key>fw_destination_root</key>
        	<string>/Applications/%NAME%.app</string>
	</dict>
	<key>Process</key>
	<array>
	<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
    	</dict>
    	<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/com.vmware.fusion.zip</string>
            </dict>
    	</dict>
	<dict>	
            <key>Processor</key>	
            <string>CodeSignatureVerifier</string>	
            <key>Arguments</key>	
            <dict>	
                <key>input_path</key>	
                <string>%RECIPE_CACHE_DIR%/%NAME%/payload/*.app</string>	
                <key>requirement</key>	
                <string>identifier "com.vmware.fusion" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = EG7KH642X6</string>	
            </dict>	
        </dict>
        <dict>
		<key>Arguments</key>
		<dict>
                <key>fw_app_bundle_id</key>
			<string>%fw_app_bundle_id%</string>
			<key>fw_app_version</key>
			<string>%version%</string>
			<key>fw_destination_root</key>
			<string>%fw_destination_root%</string>
			<key>fw_fileset_name</key>
                	<string>%NAME% - %version%</string>
			<key>fw_import_source</key>
			<string>%RECIPE_CACHE_DIR%/%NAME%/payload/VMware Fusion.app</string>
		</dict>
		<key>Processor</key>
		<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
	</dict>
	</array>
</dict>
</plist>
