<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of DotNETProfiler.
	
Valid ARCH values include:
- x64
- arm64
</string>
	<key>Identifier</key>
	<string>com.github.peshay.download.DotNETProfiler</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>DotNETProfiler</string>
		<key>ARCH</key>
		<string>x64</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="https://download\.yourkit\.com/ynp/[\d\.]+/YourKit-NetProfiler-(?P&lt;version&gt;[\d\.]+)-(?P&lt;build&gt;[a-z\d]+)-%ARCH%\.exe"</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>https://www.yourkit.com/dotnet-profiler/download/</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://download.yourkit.com/ynp/2024.9/YourKit-NetProfiler-%version%-%build%-%ARCH%.exe</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
