<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of AnyDesk.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.AnyDesk</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>AnyDesk</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
        	<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://anydesk.com/en/downloads/windows</string>
                <key>re_pattern</key>
                <string>v([0-9]+.[0-9]+.[0-9]+)[^"]*</string>
                <key>result_output_var_name</key>
                <string>version</string>
        	</dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>filename</key>
				<string>%NAME%-%version%.msi</string>
                <key>url</key>
                <string>https://download.anydesk.com/AnyDesk.msi</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
