<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of SupportApp.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.supportapp</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>SupportApp</string>
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
        <dict>
                <key>Arguments</key>
                <dict>
                        <key>github_repo</key>
                        <string>root3nl/SupportApp</string>
                        <key>asset_regex</key>
                        <string>(Support.[^"]*.pkg)</string>
                </dict>
                        <key>Processor</key>
                        <string>GitHubReleasesInfoProvider</string>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%</string>
				<key>expected_authority_names</key>
				<array>
					<string>Developer ID Installer: Root3 B.V. (98LJ4XBGYK)</string>
					<string>Developer ID Certification Authority</string>
					<string>Apple Root CA</string>
				</array>
			</dict>
		</dict>
	</array>
</dict>
</plist>
