<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of PingPlotter.</string>
	<key>Identifier</key>
	<string>com.github.peshay.download.PingPlotter</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>PingPlotter</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://www.pingplotter.com/downloads/pingplotter_osx.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
    	</dict>
    	<dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/PingPlotter.app/Contents/Info.plist</string>
            </dict>
        </dict>
	</array>
</dict>
</plist>
