<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Mindjet MindManager.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.MindManager</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mindjet MindManager</string>
        <key>OS</key>
        
<!-- "win-exe" for WINDOWS
	 "mac-dmg" for MAC OS-X
-->     
        
        <string>mac-dmg</string>
        <key>LANG</key>
        
<!-- "-en" for ENGLISH
	 "-de" for GERMAN
	 "-fr" for FRENCH
	 "-ja" for JAPANESE
	 LEAVE BLANK FOR MAC OS-X
-->
        
        <string></string>  
        <key>DOWNLOAD_URL</key>
        <string>http://www.mindjet.com/mm-%OS%%LANG%</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
