<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Mindjet MindManager Enterprise for Windows.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.MindManagerEnterpriseWin</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mindjet MindManager Enterprise</string>
<!--
"32" for 32bit Version
"64" for 64bit Version
-->
        <key>ARCH</key>
        <string>64</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
    	<dict>
        	<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.mindjet.com/support-info/enterprise-download/</string>
                <key>re_pattern</key>
                <string>400\;\"\>([0-9]+.[0-9]+.[0-9]+)</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
    	<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.mindjet.com/MindManager_%ARCH%bit_%version%_Admin.zip</string>
            </dict>
        </dict>
        <dict>
            	<key>Processor</key>
                <string>Unarchiver</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
