<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of MindManager Enterprise for Windows and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.MindManagerEnterpriseWin</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Mindjet MindManager Enterprise</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.MindManagerEnterpriseWin</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.MindManagerEnterpriseWin</string>
	<key>Process</key>
	<array>
		<dict>
        	<key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/*.msi</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.msi</string>
            </dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.msi</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
