<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of Mindjet MindManager for Windows.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.MindManagerWin</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Mindjet MindManager Windows</string>
        <key>locale</key>
        
    <!--
    	"en" for WINDOWS (English)
    	"ru" for WINDOWS (Russian)
    -->    	 
    	 
    	<string>ru</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
    	<dict>
        	<key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.mindjet.com/support-info/download-library</string>
                <key>re_pattern</key>
                <string>Build ([^"]*)\) .*"https://www.mindjet.com/mm-win-exe-%locale%</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
    	<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://download.mindjet.com/MindManager_%version%.exe</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
