<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest version of VeraCrypt from SourceForge and imports it to FileWave</string>
        <key>Identifier</key>
        <string>com.github.peshay.filewave.VeraCrypt</string>
        <key>ParentRecipe</key>
        <string>com.github.andrewvalentine.download.VeraCrypt</string>
        <key>Input</key>
        <dict>
            <key>NAME</key>
            <string>VeraCrypt</string>
            <key>fw_app_bundle_id</key>
            <string>com.github.peshay.filewave.VeraCrypt</string>
        </dict>
        <key>Process</key>
        <array>
            <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>https://www.veracrypt.fr/en/Downloads.html</string>
                    <key>re_pattern</key>
                    <string>VeraCrypt_([0-9].[0-9]+).dmg</string>
                    <key>result_output_var_name</key>
                    <string>version</string>
                </dict>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>destination_path</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                    <key>source_path</key>
                    <string>%pathname%/*.pkg</string>
                </dict>
                <key>Processor</key>
                <string>Copier</string>
            </dict>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>fw_app_bundle_id</key>
                    <string>%fw_app_bundle_id%</string>
                    <key>fw_app_version</key>
                    <string>%version%</string>
                    <key>fw_fileset_name</key>
                    <string>%NAME% - %version%</string>
                    <key>fw_import_source</key>
                    <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
                </dict>
                <key>Processor</key>
                <string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
            </dict>
        </array>
    </dict>
</plist>
