<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of MenuMeters.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.MenuMeters</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MenuMeters</string>
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
        	<key>Arguments</key>
        	<dict>
          		<key>github_repo</key>
          		<string>yujitach/MenuMeters</string>
          		<key>asset_regex</key>
			<string>(MenuMeters_[^"]*.zip)</string>
        	</dict>
        		<key>Processor</key>
        		<string>GitHubReleasesInfoProvider</string>
      		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
                        <key>Processor</key>
                        <string>Unarchiver</string>
                </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
