<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest FileZilla disk image and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.FileZilla</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>FileZilla</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.FileZilla</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.keeleysam.recipes.FileZilla.download</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>FileZillaURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>94d81d1e796db36cd4f56fab8de5ceca6a04f966</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.keeleysam-recipes/FileZilla/FileZillaURLProvider.py</string>
				<key>sha256_hash</key>
				<string>74a0df416ade8dbbc70169b48fe7acd4eb0dae2794999ab4bda895323c646220</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.keeleysam.recipes.FileZilla.download</key>
			<dict>
				<key>git_hash</key>
				<string>b0cea7d89566df5c0e2a92cfebff2734ca6c538b</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.keeleysam-recipes/FileZilla/FileZilla.download.recipe</string>
				<key>sha256_hash</key>
				<string>2933e3b1ffbb88f76625ccc10424540f0e3cc765055ebb735008e8873a58e36e</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>release ([0-9]+.[0-9]+.[^"]*) http</string>
				<key>result_output_var_name</key>
				<string>version</string>
				<key>url</key>
				<string>http://update.filezilla-project.org/updatecheck.php?platform=i686-apple-darwin9&amp;version=3.0.0&amp;osversion=12</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
