<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Adobe Creative Cloud.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.Adobe-Creative-Cloud-Win</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Adobe Creative Cloud</string>
		<key>USER_AGENT</key>
		<string>Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/110.0.0.0 Safari/537.36</string>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>user-agent</key>
				<string>%USER_AGENT%</string>
				<key>filename</key>
				<string>%NAME%.exe</string>
				<key>url</key>
				<string>https://prod-rel-ffc-ccm.oobesaas.adobe.com/adobe-ffc-external/core/v1/wam/download?sapCode=KCCC&amp;productName=CreativeCloud&amp;os=win</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
