<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Imports Creative Cloud Installer into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.AdobeCreativeCloudInstaller</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Creative Cloud Installer</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.AdobeCreativeCloudInstaller</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.rtrouton.pkg.AdobeCreativeCloudInstaller</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.rtrouton.download.AdobeCreativeCloudInstaller</key>
			<dict>
				<key>git_hash</key>
				<string>8e5f1e080f2bf3ecc4749634071d8c15455ddc0a</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/AdobeCreativeCloud/AdobeCreativeCloudInstaller.download.recipe</string>
				<key>sha256_hash</key>
				<string>1644b0333520bfc73cc93b90f2e8ac0437649c23e043ea6c3f27c1df9a42d7e8</string>
			</dict>
			<key>com.github.rtrouton.pkg.AdobeCreativeCloudInstaller</key>
			<dict>
				<key>git_hash</key>
				<string>8e5f1e080f2bf3ecc4749634071d8c15455ddc0a</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.rtrouton-recipes/AdobeCreativeCloud/AdobeCreativeCloudInstaller.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>7a24313948e63e23090f584d3baac5e448a9155869781d7cf0c482b9d34390e9</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/AdobeCreativeCloudInstaller-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
