<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>Description</key>
    <string>Downloads the latest version of Adobe Acrobat Reader DC and imports into FileWave</string>
    <key>Identifier</key>
    <string>com.github.peshay.filewave.AdobeAcrobatReaderDCUpdates</string>
    <key>MinimumVersion</key>
    <string>0.3.1</string>
    <key>ParentRecipe</key>
    <string>com.github.novaksam.download.AdobeAcrobatReaderDCUpdates</string>
    <key>Input</key>
    <dict>
      <key>NAME</key>
      <string>Adobe Acrobat Reader DC</string>
      <key>fw_app_bundle_id</key>
      <string>com.github.peshay.filewave.AdobeAcrobatReaderDCUpdates</string>
    </dict>
    <key>Process</key>
    <array>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>destination_path</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
          <key>source_path</key>
          <string>%pathname%/*.pkg</string>
        </dict>
        <key>Processor</key>
        <string>Copier</string>
      </dict>
      <dict>
        <key>Arguments</key>
        <dict>
          <key>fw_app_bundle_id</key>
          <string>%fw_app_bundle_id%</string>
          <key>fw_app_version</key>
          <string>%version%</string>
          <key>fw_fileset_name</key>
          <string>%NAME% - %version%</string>
          <key>fw_import_source</key>
          <string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
        </dict>
        <key>Processor</key>
        <string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
      </dict>
    </array>
  </dict>
</plist>
