<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of RawTherapee.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.RawTherapee</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RawTherapee</string>
	
<!--SELECT YOUR OS VERSION AND INPUT BELOW
	"mac" for MAC OS X
	"windows" for WINDOWS
-->

		<key>os</key>
		<string>mac</string><!-- <<<<<< INPUT HERE <<<<<< -->
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://rawtherapee.com/downloads</string>
                <key>re_pattern</key>
                <string>href="./releases_head/%os%/([^"]*).zip"</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>http://rawtherapee.com/releases_head/%os%/%match%.zip</string>
			</dict>
		</dict>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://rawtherapee.com/downloads</string>
                <key>re_pattern</key>
                <string>href="./releases_head/%os%/[^"]*_([0-9]+.[0-9]+.[0-9]+).zip"</string>
                <key>result_output_var_name</key>
                <string>version</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
    	</dict>
	</array>
</dict>
</plist>
