<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of RawTherapee.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.RawTherapee</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>RawTherapee</string>
	
<!--SELECT YOUR OS VERSION AND INPUT BELOW
	"mac" for MAC OS X
	"windows" for WINDOWS
-->

		<key>os</key>
		<string>mac</string><!-- <<<<<< INPUT HERE <<<<<< -->
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://rawtherapee.com/downloads</string>
                <key>re_pattern</key>
                <string>/shared/builds/%os%/([^"]*).dmg</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>https://rawtherapee.com/shared/builds/%os%/%match%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pathname%/%NAME%.app/Contents/Info.plist</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%pathname%/%NAME%.app</string>
				<key>requirement</key>
				<string>identifier "com.rawtherapee.rawtherapee" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5SJ86G6Q2R"</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
