<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest TeamViewer disk image and import to Filewave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.TeamViewer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>TeamViewer</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.TeamViewer</string>
		<key>fw_destination_root</key>
		<string>/Applications/TeamViewer.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.download.TeamViewer</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>flat_pkg_path</key>
				<string>%pathname%/*.pkg</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict/>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Applications</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/TeamViewerApp.pkg/Payload</string>
			</dict>
			<key>Comment</key>
			<string>TeamViewer 9 installs in /Applications/TeamViewer.app so extract accordingly</string>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Applications/TeamViewer.app/Contents/Info.plist</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/payload/root/Applications/TeamViewer.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
