<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of Caffeine and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.Caffeine</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Caffeine</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.Caffeine</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.keeleysam.recipes.Caffeine.download</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.keeleysam.recipes.Caffeine.download</key>
			<dict>
				<key>git_hash</key>
				<string>f6df176e67433ef78fb1621ca56724a5e8bc4860</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.keeleysam-recipes/Caffeine/Caffeine.download.recipe</string>
				<key>sha256_hash</key>
				<string>0f46f4d83d6c4ba54f7ca8a7406ead1ef8921a90b8444ab04693b1e84e050e64</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
