<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads latest version of Visual Studio Code and imports into FileWave.</string>
		<key>Identifier</key>
		<string>com.github.peshay.filewave.visualstudiocode</string>
		<key>MinimumVersion</key>
		<string>0.2.0</string>
		<key>ParentRecipe</key>
		<string>com.github.killahquam.download.visualstudiocode</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Visual Studio Code</string>
			<key>fw_app_bundle_id</key>
			<string>com.github.peshay.filewave.visualstudiocode</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_plist_path</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Visual Studio Code.app/Contents/Info.plist</string>
				</dict>
				<key>Processor</key>
				<string>Versioner</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>fw_app_bundle_id</key>
					<string>%fw_app_bundle_id%</string>
					<key>fw_app_version</key>
					<string>%version%</string>
					<key>fw_fileset_name</key>
					<string>%NAME% - %version%</string>
					<key>fw_import_source</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Visual Studio Code.app</string>
				</dict>
				<key>Processor</key>
				<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
			</dict>
		</array>
	</dict>
</plist>
