<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of jEdit.</string>
	<key>Identifier</key>
	<string>com.github.peshay.download.jEdit</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>jEdit</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
        <dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.jedit.org/index.php?page=download</string>
                <key>result_output_var_name</key>
                <string>version</string>
                <key>re_pattern</key>
                <string>Stable version: jEdit ([0-9]+.[0-9]+.[0-9]+)</string>
            </dict>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>https://netcologne.dl.sourceforge.net/project/jedit/jedit/%version%/jedit%version%install.dmg</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
        <dict>
			<key>Arguments</key>
			<dict>
				<key>dmg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>AppDmgVersioner</string>
		</dict>
	</array>
</dict>
</plist>
