<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Oxygen XML Web Author, creates a fileset, and copies it into your FileWave Server.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.OxygenWebAuthor</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>oxygen-xml-web-author</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.OxygenWebAuthor</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.OxygenWebAuthor</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version% - %platform_name%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>com.github.johncclayton.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
