<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of Oxygen XML Editor, creates a fileset, and copies it into your FileWave Server.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.OxygenEditor.MacOSX</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>OxygenEditor</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.OxygenEditor.MacOSX</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%</string>
		<key>platform_name</key>
		<string>MacOSX</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.OxygenEditor</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>OxygenURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>28b7662a16460a78fa11d2e7ed0019db0882e2e3</string>
				<key>path</key>
				<string>/Users/ahu/git/peshay/peshay-recipes/OxygenXML/OxygenURLProvider.py</string>
				<key>sha256_hash</key>
				<string>8a2606a47013352753ee2439ab5258e31509a2736c2364566c54117e7dfe0bcf</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.peshay.download.OxygenEditor</key>
			<dict>
				<key>git_hash</key>
				<string>05e3100546e75a8df2b0683c58061e0aa2ef393d</string>
				<key>path</key>
				<string>/Users/ahu/git/peshay/peshay-recipes/OxygenXML/OxygenEditor.download.recipe</string>
				<key>sha256_hash</key>
				<string>9af03fa7571dbabd948c8d104540a5d85ce2934f2b4e99a5f632620cbcd8359d</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/Oxygen XML Editor</string>
				<key>source_path</key>
				<string>%pathname%/Oxygen XML Editor/</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version% - %buildid%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/Oxygen XML Editor</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
