<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of KeePassXC and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.KeePassXC</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>KeePassXC</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.KeePassXC</string>
		<key>fw_destination_root</key>
		<string>/Applications/KeePassXC.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.n8felton.download.KeePassXC</string>
	<key>Process</key>
	<array>
		<dict>
            		<key>Processor</key>
            		<string>CodeSignatureVerifier</string>
            		<key>Arguments</key>
            		<dict>
                		<key>input_path</key>
				<string>%pathname%/*.app</string>
                		<key>requirement</key>
                		<string>identifier "org.keepassx.keepassxc" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = G2S7P7J672</string>
            		</dict>
        	</dict>
		<dict>
                        <key>Arguments</key>
                        <dict>
                                <key>pkgdirs</key>
                                <dict>
                                        <key>Applications</key>
                                        <string>0775</string>
                                </dict>
                                <key>pkgroot</key>
                                <string>%RECIPE_CACHE_DIR%/Applications</string>
                        </dict>
                        <key>Processor</key>
                        <string>PkgRootCreator</string>
                </dict>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>destination_path</key>
                                <string>%pkgroot%/KeePassXC.app</string>
                                <key>source_path</key>
                                <string>%pathname%/*.app</string>
                        </dict>
                        <key>Processor</key>
                        <string>Copier</string>
                </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/KeePassXC.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
