<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Pock and imports it to FileWave</string>
		<key>Identifier</key>
		<string>com.github.peshay.filewave.Pock</string>
		<key>MinimumVersion</key>
		<string>1.0.0</string>
		<key>ParentRecipe</key>
		<string>com.github.blackthroat.download.Pock</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Pock</string>
			<key>fw_app_bundle_id</key>
			<string>com.github.peshay.filewave.Pock</string>
			<key>fw_destination_root</key>
			<string>/Applications/Pock.app</string>
		</dict>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>fw_app_bundle_id</key>
					<string>%fw_app_bundle_id%</string>
					<key>fw_app_version</key>
					<string>%version%</string>
					<key>fw_destination_root</key>
					<string>%fw_destination_root%</string>
					<key>fw_fileset_name</key>
					<string>%NAME% - %version%</string>
					<key>fw_import_source</key>
					<string>%RECIPE_CACHE_DIR%/%NAME%/Pock.app</string>
				</dict>
				<key>Processor</key>
				<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
			</dict>
		</array>
	</dict>
</plist>
