<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest version of miro.</string> 
	<key>Identifier</key>
	<string>com.github.peshay.download.miro</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>miro</string>
		<!-- VALID os FOR THIS RECIPE ARE: darwin (OS X), win32 (Windows 64bit), win32-x86 (Windows 32bit) -->
		<key>os</key>
		<string></string>
	</dict>
	<key>MinimumVersion</key>
    <string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://realtimeboard.com/apps/</string>
                <key>result_output_var_name</key>
                <string>url</string>
                <key>re_pattern</key>
                <string>href="(https://desktop.realtimeboard.com/platforms/%os%/[^"]*.[^"]*)" target=</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
		<key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13) AppleWebKit/601.1.39 (KHTML, like Gecko) Version/9.0 Safari/601.1.39</string>
                </dict>
                <key>url</key>
                <string>https://desktop.realtimeboard.com/platforms/darwin/Miro%20-%20formerly%20RealtimeBoard.dmg</string>
            </dict>
        </dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
