<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of VirtualBox and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.VirtualBox</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>VirtualBox</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.VirtualBox</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.sheagcraig.pkg.VirtualBox</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.sheagcraig.download.VirtualBox</key>
			<dict>
				<key>git_hash</key>
				<string>ef71a5ad37488b7187e21bd3ea19f136753f3146</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.sheagcraig-recipes/VirtualBox/VirtualBox.download.recipe</string>
				<key>sha256_hash</key>
				<string>f232346691440eef33a0154055cada9054d5ef711e18152cb61c4ecd7b75c44f</string>
			</dict>
			<key>com.github.sheagcraig.pkg.VirtualBox</key>
			<dict>
				<key>git_hash</key>
				<string>13fef4ea366eaeba5bfb1f3bf9b952b3a07abc49</string>
				<key>path</key>
				<string>/Users/ahu/Library/AutoPkg/RecipeRepos/com.github.autopkg.sheagcraig-recipes/VirtualBox/VirtualBox.pkg.recipe</string>
				<key>sha256_hash</key>
				<string>1fa9740264ce79350234fd39569a2f39f56bd866ff2912a87f2158dabfbd8f85</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/unpack/VirtualBox.pkg.unpacked/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
