<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v1.0.2 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of XMind, creates a fileset, and copies it into your FileWave Server.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.XMind</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>XMind</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.XMind</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.XMind</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict>
			<key>XMindURLProvider</key>
			<dict>
				<key>git_hash</key>
				<string>f4c8a76f2a7a0a912489e383d02a9050c424e1dd</string>
				<key>path</key>
				<string>/Users/ahu/git/peshay/peshay-recipes/Xmind/XMindURLProvider.py</string>
				<key>sha256_hash</key>
				<string>0a04584a3d332d6fad7783e55d27880fe159ec5d9cf3029364d2050b660a13eb</string>
			</dict>
		</dict>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.peshay.download.XMind</key>
			<dict>
				<key>git_hash</key>
				<string>1a4e51b774860d6ba4f855be6607960c19f3c921</string>
				<key>path</key>
				<string>/Users/ahu/git/peshay/peshay-recipes/Xmind/XMind.download.recipe</string>
				<key>sha256_hash</key>
				<string>f648876458a6f1b5a81bf29abf05ca47c9ac53c4be459c3962d6596d77d69ac2</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%filename%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
				<key>source_path</key>
				<string>%pathname%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% %version% (v%version2%)</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
