<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of InstallDiskCreator.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.InstallDiskCreator</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>InstallDiskCreator</string>
        <key>URL</key>
        <string>https://macdaddy.io/InstallDiskCreator.zip</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>Consider switching to the InstallDiskCreator recipes in the ahousseini-recipes repo. This recipe is deprecated and will be removed in the future.</string>
            </dict>
        </dict>
        <dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
                <key>url</key>
                <string>%URL%</string>
			</dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
		<dict>
            <key>Processor</key>
            <string>Unarchiver</string>
    	</dict>
    	<dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/Install Disk Creator.app</string>
                <key>target</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/InstallDiskCreator.app</string>
            </dict>
        </dict>
		<dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/InstallDiskCreator.app/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/InstallDiskCreator.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "io.macdaddy.Install-Disk-Creator" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "8G7S5244GJ")</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
