<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest version of InstallDiskCreator and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.InstallDiskCreator</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>InstallDiskCreator</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.InstallDiskCreator</string>
		<key>fw_destination_root</key>
		<string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>com.github.peshay.download.InstallDiskCreator</string>
	<key>ParentRecipeTrustInfo</key>
	<dict>
		<key>non_core_processors</key>
		<dict/>
		<key>parent_recipes</key>
		<dict>
			<key>com.github.peshay.download.InstallDiskCreator</key>
			<dict>
				<key>git_hash</key>
				<string>4548f3180f037b66bf99bde743f4275a787e57e8</string>
				<key>path</key>
				<string>/Users/ahu/git/peshay/peshay-recipes/InstallDiskCreator/InstallDiskCreator.download.recipe</string>
				<key>sha256_hash</key>
				<string>a5c7e940a63bffd2782d8c9a4c8e3a85e1fba3e8d62f2c68327cd95d6cbb8d48</string>
			</dict>
		</dict>
	</dict>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
