<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of DOSBox.</string>
    <key>Identifier</key>
    <string>com.github.peshay.download.DOSBox</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>DOSBox</string>
        <key>os</key>
        <!--SELECT YOUR OS VERSION AND INPUT BELOW
        "Mac OS X" for MAC OS X
        "Windows" for WINDOWS EXE
        "Fedora" for FEDORA LINUX
        -->
        <string>Mac OS X</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.6.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.dosbox.com/download.php?main=1</string>
                <key>re_pattern</key>
                <string>href="(https://sourceforge\.net/projects/dosbox/files/dosbox/[\d\.-]+/DOSBox-[\d\.-]+\.dmg/download)" target="_blank">%os%</string>
                <key>re_flags</key>
                <array>
                    <string>IGNORECASE</string>
                </array>
                <key>result_output_var_name</key>
                <string>url</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/DOSBox.app</string>
                <key>requirement</key>
                <string>identifier "com.dosbox.dosbox" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "5PRK96AWD5"</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/Applications</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Applications</key>
                    <string>0775</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>destination_path</key>
                <string>%pkgroot%/DOSBox.app</string>
                <key>source_path</key>
                <string>%pathname%/*.app</string>
            </dict>
            <key>Processor</key>
            <string>Copier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%pkgroot%/DOSBox.app/Contents/Info.plist</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
