<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads latest iTerm2 disk image and import to Filewave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.iTerm2</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>iTerm</string>
        <key>SPARKLE_FEED_URL</key>
        <string>https://www.iterm2.com/appcasts/final.xml</string>
        <key>fw_app_bundle_id</key>
        <string>com.github.peshay.filewave.iTerm2</string>
        <key>fw_destination_root</key>
        <string>/Applications/%NAME%.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.keeleysam.autopkg.download.iTerm2</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/Applications</string>
			</dict>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
                <key>fw_app_bundle_id</key>
				<string>%fw_app_bundle_id%</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_destination_root</key>
				<string>%fw_destination_root%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%pkgroot%/Applications/%NAME%.app</string>
			</dict>
			<key>Processor</key>
			<string>com.github.johncclayton.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
