<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Packages and imports into FileWave.</string>
	<key>Identifier</key>
	<string>com.github.peshay.filewave.Packages</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Packages</string>
		<key>fw_app_bundle_id</key>
		<string>com.github.peshay.filewave.Packages</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>ParentRecipe</key>
	<string>io.github.hjuutilainen.pkg.Packages</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>http://s.sudre.free.fr/Software/Packages/about.html</string>
				<key>re_pattern</key>
				<string>Version[^"]*([0-9]+.[0-9]+.[0-9]+)</string>
				<key>re_flags</key>
				<array>
					<string>IGNORECASE</string>
				</array>
		<key>result_output_var_name</key>
		<string>version</string>
			</dict>
</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>fw_app_bundle_id</key>
				<string>com.github.peshay.filewave.Packages</string>
				<key>fw_app_version</key>
				<string>%version%</string>
				<key>fw_fileset_name</key>
				<string>%NAME% - %version%</string>
				<key>fw_import_source</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%.pkg</string>
			</dict>
			<key>Comment</key>
			<string>Import the Packages pkg into FileWave</string>
			<key>Processor</key>
			<string>com.github.autopkg.filewave.FWTool/FileWaveImporter</string>
		</dict>
	</array>
</dict>
</plist>
