<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads 5kplayer.</string>
	<key>Identifier</key>
	<string>com.github.peshay.download.5kplayer</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>5kplayer</string>
		<key>url</key>
		<string><![CDATA[<http://files.downloadnow.com/s/software/15/28/64/78/5kplayer.dmg?token=1472174181_33df3458b345b7a386763f3744930ef4&fileName=5kplayer.dmg]]></string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.6.1</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
				<string>%url%</string>
            </dict>
		</dict>
        <dict>
            <key>Processor</key>
            <string>AppDmgVersioner</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_path</key>
                <string>%pathname%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/%NAME%.app</string>
                <key>requirement</key>
                <string>anchor apple generic and identifier "com.digiarty.5kplayer" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = Q5K8LAV554)</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
	</array>
</dict>
</plist>
